/// 5. 数组 ///
//存放相同类型的数据元素
//要求内存连续

#include<iostream>

using namespace std;
int main()
{

//5.1 一维数组——3种定义形式
//数组长度！=索引max
//1.数据类型 数组名[数组长度]；
int arr[5];
//通过索引赋值和引用
arr[0] = 10;
arr[1] = 20;
cout << arr[0] << endl;

//2.数据类型 数组命[数组长度] = {元素1,元素2，....}
int arr1[3] = {10,20,30};
//循环输出元素
for(int i = 0; i < 3; i++)
{
    cout << arr1[i] << endl;
}

//3. 数据类型 数组名[] = {元素1,元素2,...}
int arr2[] = {10,40,80,160};
//元素必须确定，决定数组长度


//5.1.1 一维数组数组名
























































    system("pause");
    return 0;
}

