/// 3. 运算符 ///
//算术～，赋值～，比较～，逻辑～
//两个整型相除结果依然是整型，小数相除可以是整数也可以是小数

#include<iostream>
using namespace std;
int main(){
//3.1 算术运算符
//%-取模，求余数
int a1 = 10;
int b1 = 20;
cout << a1/b1 << endl;  //结果是0
//两个小数不可以做取模运算

//递增(递减类似)
//前置递增——变量先加，再计算表达式
    int a2 = 0;
    int b2 = ++a2*10;
    cout << a2 <<endl;
    cout << b2 <<endl;
//输出a=1,b=10

//后置递增——先计算表达式，再加变量
    int a3 = 0;
    int b3 = a3++*10;
    cout << a3 <<endl;
    cout << b3 <<endl;
//输出a=1,b=0


//3.2 赋值运算符
int a4 = 4;
a4 += 2;    //a4=6
int b4 = 3;
b4 -= 1;    //b4=2

a4 *= 2;    //a4=12
// /=,%=

//比较运算符
//==，！=，>,>=....

//逻辑运算符
//或-||，与-&&，非-！
int a = 10; //!a=0,!!a=1
int b = 0;
//a&&b=0,两条件都为真才为真，只要一个为假就是假
//a||b=1,只要有1个就为真

}